Repository: KDE/ark
Catalog: po/*/ark.po
Languages: th

# @info
source: Could not overwrite <filename>%1</filename>. Check whether you have write permission.
th: ไม่สามารถเขียนทับ <filename>%1</filename> ได้ โปรดตรวจสอบว่าคุณมีความอนุญาตในการเขียน

# @info
source: The archive <filename>%1</filename> will be created as soon as you add a file.
th: อาร์ไคฟ์ <filename>%1</filename> จะถูกสร้างขึ้นเมื่อคุณเพิ่มไฟล์

# @info
source: The archive <filename>%1</filename> was not found.
th: ไม่พบอาร์ไคฟ์ <filename>%1</filename>

# @info
source: The archive <filename>%1</filename> could not be loaded, as it was not possible to read from it.
th: อาร์ไคฟ์ <filename>%1</filename> ไม่สามารถโหลดได้ เนื่องจากเป็นไปไม่ได้ที่จะอ่านจากมัน

# @info
source: The archive is empty or Ark could not open its content.
th: อาร์ไคฟ์ว่างปล่าวหรือ Ark ไม่สามารถเปิดเนื้อหาของมันได้

# @info
source: Ark does not currently support ISO files with UDF filesystem.
th: Ark นั้นยังไม่รองรับไฟล์ ISO ที่มีระบบไฟล์ UDF

# @info
source: Loading the archive <filename>%1</filename> failed with the following error:<nl/><message>%2</message>
th: การโหลดอาร์ไคฟ์ <filename>%1</filename> ล้มเหลวด้วยข้อผิดพลาด:<nl/><message>%2</message>

source: Ark cannot open symlinks.
th: Ark ไม่สามารถเปิด symlink ได้

source: The file <filename>%1</filename> was modified. Do you want to update the archive?
th: ไฟล์ <filename>%1</filename> ถูกแก้ไข คุณต้องการที่จะอัพเดทอาร์ไคฟ์หรือไม่

# @title:window
source: File Modified
th: ไฟล์ถูกแก้ไข

# @action:button
source: Update
th: อัพเดท

# @action:button
source: Ignore
th: ไม่สนใจ

# @title:window
source: Add Files
th: เพิ่มแฟ้มต่างๆ

# @title:window
source: Add Files to %1
th: เพิ่มไฟล์ไปยัง %1

source: Filename can't contain slashes and can't be equal to "." or ".."
th: ชื่อไฟล์ไม่สามารถมีทับและไม่สามารถเท่ากับ "." หรือ ".." ได้

source: Folders can't be moved into themselves.
th: โฟลเดอร์ไม่สามารถถูกย้ายเข้าไปยังตัวมันเองได้

source: Moving a folder into itself
th: การย้ายโฟลเดอร์เข้าไปในตัวมันเอง

source: Entries with the same names can't be pasted to the same destination.
th: รายการที่มีชื่อเดียวกันไม่สามารถถูกวางไว้ในที่หมายเดียวกันได้

# @info
source: Deleting this file is not undoable. Are you sure you want to do this?
th: การลบไฟล์เหล่านี้ไม่สามารถย้อนกลับได้ คุณแน่ใจหรือว่าคุณจะทำสิ่งนี้

# @title:window
source: Delete File
th: ลบไฟล์

# @title:window
source: Save Copy As
th: บันทึกสำเนาเป็น

# @info
source: The archive could not be saved as <filename>%1</filename>. Try saving it to another location.
th: ไม่สามารถบันทึกอาร์ไคฟ์เป็น <filename>%1</filename> ได้ โปรดลองทำการบันทึกไปยังตำแหน่งอื่น

# @info
source: The archive <filename>%1</filename> does not exist anymore, therefore it cannot be copied to the specified location.
th: อาร์ไคฟ์ <filename>%1</filename> ไม่มีอยู่อีกต่อไปแล้ว ดังนั้นมันจึงไม่สามารถถูกคัดลอกไปยังที่หมายได้

source: Listing the archive failed.
th: ล้มเหลวในการแสดงรายการในอาร์ไคฟ์

source: Extraction failed due to an unknown error.
th: การแตกไฟล์ล้มเหลวเนื่องจากข้อผิดพลาดที่ไม่อาจทราบได้

source: Extraction failed due to one or more corrupt files. Any extracted files may be damaged.
th: การแตกไฟล์ล้มเหลวเนื่องจากไฟล์เสียหาย ไฟล์ที่ถูกแตกออกไปอาจมีความเสียหาย

source: Delete operation failed. Try upgrading 7z or disabling the 7z plugin in the configuration dialog.
th: กระบวนการลบล้มเหลว โปรดลองอัพเกรด 7z หรือปิดปลั๊กอิน 7z ในไดอะล็อกการตั้งค่า

source: ARJ old
th: ARJ แบบเก่า

source: GOST 40-bit
th: GOST 40 บิต

source: unknown
th: ไม่ทราบวิธี

source: Failed to find all archive volumes.
th: ล้มเหลวในการหาวอลุ่มอาร์ไคฟ์ทั้งหมด

source: Your unrar executable is version %1, which is too old to handle this archive. Please update to a more recent version.
th: ไฟล์ปฏิบัติการ unrar ของคุณเวอร์ชัน %1 ซึ่งเก่าเกินกว่าที่จะเปิดอาร์ไคฟ์นี้ได้ โปรดอัพเดทเป็นเวอร์ชันที่ใหม่กว่า

source: Unrar reported a non-RAR archive. The installed unrar version (%1) is old. Try updating your unrar.
th: Unrar แจ้งว่าเป็นอาร์ไคฟ์ที่ไม่ใช่ไฟล์ RAR เวอร์ชัน unrar ที่ติดตั้งอยู่ (%1) นั้นเก่า โปรดลองอัพเดท unrar ของคุณ

source: One or more wrong checksums
th: Checksum ไม่ถูกต้อง

source: Extraction failed.
th: การแตกไฟล์ล้มเหลว

source: Not enough memory for loading the archive.
th: หน่วยความจำไม่เพียงพอในการโหลดไฟล์อาร์ไคฟ์

source: Wrong password.
th: รหัสผ่านไม่ถูกต้อง

source: Extraction failed due to unsupported compression method (%1).
th: การแตกไฟล์ล้มเหลวเนื่องจากวิธีการบีบอัดที่ไม่รองรับ (%1)

source: Extraction failed due to unsupported encryption method.
th: การแตกไฟล์ล้มเหลวเนื่องจากวิธีการเข้ารหัสที่ไม่รองรับ

# referred to compression method
source: unknown
th: ไม่ทราบวิธี

# @info
source: The archive may be corrupt or has header-encryption, which is currently not supported.
th: ไฟล์อาร์ไคฟ์อาจเสียหายหรือมีการเข้ารหัสส่วนหัว ซึ่งยังไม่รองรับในขณะนี้

# @info
source: Fatal error, extraction aborted.
th: ข้อผิดพลาดร้ายแรง การแตกไฟล์ถูกยกเลิก

# @info
source: Extraction of encrypted 7-zip entries is currently not supported.
th: การแตกไฟล์ 7-zip รายการที่เข้ารหัสนั้นยังไม่รองรับในขณะนี้

source: The archive reader could not be initialized.
th: ไม่สามารถเตรียมการทำงานของตัวอ่านแฟ้มจัดเก็บได้

# @info
source: Archive corrupted or insufficient permissions.
th: อาร์ไคฟ์เสียหายหรือมีการอนุญาตไม่เพียงพอ

# @info
source: Failed to create a temporary file for writing data.
th: ล้มเหลวในการสร้างไฟล์ชั่วคราวสำหรับการเขียนข้อมูล

source: The archive writer could not be initialized.
th: ไม่สามารถเตรียมการทำงานของตัวเขียนแฟ้มจัดเก็บได้

# @info
source: Could not open the archive for writing entries.
th: ไม่สามารถเปิดอาร์ไคฟ์สำหรับการเขียนรายการได้

source: The compression type '%1' is not supported by Ark.
th: อาร์กยังไม่รองรับการบีบอัดข้อมูลประเภท '%1'

# @info
source: Could not set the compression method.
th: ไม่สามารถตั้งวิธีการบีบอัดได้

# @info
source: Could not set the compression level.
th: ไม่สามารถตั้งระดับการบีบอัดได้

# @info
source: Could not compress entry, operation aborted.
th: ไม่สามารถบีบอัดรายการนี้ได้ การกระทำถูกยกเลิก

# @info Error in a message box
source: Could not compress entry.
th: ไม่สามารถบีบอัดรายการได้

source: Failed to open archive: %1
th: ล้มเหลวในการเปิดอาร์ไคฟ์: %1

source: Failed to write archive.
th: ล้มเหลวในการเขียนอาร์ไคฟ์

source: Failed to add entry: %1
th: ล้มเหลวในการเพิ่มรายการ: %1

source: Failed to set compression options for entry: %1
th: ล้มเหลวในการตั้งค่าการบีบอัดสำหรับรายการ: %1

source: Failed to read metadata for entry: %1
th: ล้มเหลวในการอ่านเมตาดาตาสำหรับรายการ: %1

source: Failed to delete entry: %1
th: ล้มเหลวในการลบรายการ: %1

source: Failed to create directory: %1
th: ล้มเหลวในการสร้างโฟลเดอร์: %1

source: Failed to open '%1':<nl/>%2
th: ล้มเหลวในการเปิด '%1':<nl/>%2

source: Failed to open file for writing: %1
th: ล้มเหลวในการเปิดไฟล์สำหรับเขียน: %1

source: Failed to read data for entry: %1
th: ล้มเหลวในการอ่านข้อมูลสำหรับรายการ: %1

source: Failed to write data for entry: %1
th: ล้มเหลวในการเขียนข้อมูลสำหรับรายการ: %1

source: Failed to locate entry: %1
th: ล้มเหลวในการหารายการ: %1

source: Failed to move entry: %1
th: ล้มเหลวในการย้ายรายการ: %1

source: Failed to copy entry: %1
th: ล้มเหลวในการคัดลอกรายการ: %1

source: Failed to set metadata for entry: %1
th: ล้มเหลวในการตั้งเมตาดาตาสำหรับรายการ: %1
