Repository: KDE/ark
Catalog: po/*/ark.po
Languages: th

# NAME OF TRANSLATORS
source: Your names
th: ถนอมทรัพย์ นพบูรณ์, ศตคุณ อุตมะ

# EMAIL OF TRANSLATORS
source: Your emails
th: donga.nb@gmail.com, linesofcodes@dailitation.xyz

# Noun, not a verb. Top level menu item, i.e. like File
source: &Archive
th: &อาร์ไคฟ์

source: Extracting Files
th: กำลังแตกไฟล์

source: Source archive
th: แฟ้มจัดเก็บต้นทาง

source: Destination
th: ปลายทาง

source: The following files could not be extracted:
th: ไม่สามารถทำการคลายแฟ้มต่าง ๆ ต่อไปนี้ได้:

# @info
source: There was an error while extracting <filename>%1</filename>. Any further archive will not be extracted.
th: เกิดข้อผิดพลาดระหว่างทำการแตกไฟล์ <filename>%1</filename> การแตกไฟล์จะไม่ถูกดำเนินการต่อ

# @info
source: There was an error while extracting <filename>%1</filename>:<nl/><message>%2</message><nl/>Any further archive will not be extracted.
th: เกิดข้อผิดพลาดระหว่างทำการแตกไฟล์ <filename>%1</filename>:<nl/><message>%2</message><nl/>จะไม่มีการแตกไฟล์อาร์ไคฟ์อื่น ๆ

# @info
source: There was an error while extracting <filename>%1</filename>.
th: เกิดข้อผิดพลาดระหว่างการแตกไฟล์ <filename>%1</filename>

# @info
source: There was an error while extracting <filename>%1</filename>:<nl/><message>%2</message>
th: เกิดข้อผิดพลาดระหว่างการแตกไฟล์ <filename>%1</filename>:<nl/><message>%2</message>

# @info
source: The archive could not be extracted to <filename>%1</filename> because Ark can only extract to local destinations.
th: ไม่สามารถแตกไฟล์ไปยัง <filename>%1</filename> ได้ เนื่องจาก Ark สามารถแตกไฟล์ไปยังสถานที่ภายในเครื่องเท่านั้น

# @action:inmenu Compress submenu in Dolphin context menu
source: Compress
th: บีบอัด

# @action:inmenu Part of Compress submenu in Dolphin context menu
source: Compress to…
th: บีบอัดไปยัง...

# @action:inmenu Part of Compress submenu in Dolphin context menu, %1 filename
source: Compress to "%1"
th: บีบอัดเป็น "%1"

# Default name of a newly-created multi-file archive
source: Archive
th: อาร์ไคฟ์

# @action:inmenu Part of Extract submenu in Dolphin context menu
source: Extract to…
th: แตกไฟล์ไปยัง...

# @action:inmenu Part of Extract submenu in Dolphin context menu
source: Extract here
th: แตกไฟล์ที่นี่

# @action:inmenu Extract submenu in Dolphin context menu
source: Extract
th: แตกไฟล์

# @action:inmenu Context menu shown when an archive is being drag'n'dropped
source: Extract here
th: แตกไฟล์ที่นี่

source: KDE Archiving tool
th: เครื่องมือจัดการแฟ้มจัดเก็บของ KDE

source: © 1997–2025 The Ark Developers
th: สงวนลิขสิทธิ์ © 1997-2010 กลุ่มผู้พัฒนา Ark

source: Maintainer
th: ผู้ดูแล

source: Maintainer, KF5 port
th: ผู้ดูแล, พอร์ต KF5

source: Former Maintainer
th: ผู้ดูแลก่อนหน้านี้

source: Former maintainer
th: ผู้ดูแลก่อนหน้านี้

source: Advanced editing functionalities
th: ฟังก์ชันการแก้ไขขั้นสูง

source: Icons
th: ไอคอน

source: Ideas, help with the icons
th: แนวคิด, ความช่วยเหลือกับไอคอนชุดนี้

source: bkisofs code
th: โค้ดส่วน bkisofs

source: URLs to open.
th: URL ที่ต้องการเปิด

source: Show a dialog for specifying the options for the operation (extract/add)
th: แสดงกล่องระบุค่าตัวเลือกของปฏิบัติการนี้ (คลายแฟ้ม/เพิ่มแฟ้ม)

source: Destination folder to extract to. Defaults to current path if not specified.
th: โฟลเดอร์ปลายทางที่จะทำการคลายแฟ้มไปเก็บไว้ หากไม่มีการระบุจะใช้ค่าพาธที่ใช้งานอยู่ในปัจจุบัน

source: Open destination folder after extraction.
th: เปิดโฟลเดอร์ปลายทางหลังจากทำการแตกไฟล์

source: Query the user for an archive filename and add specified files to it. Quit when finished.
th: ให้ผู้ใช้ค้นหาชื่อแฟ้มของแฟ้มจัดเก็บ และเพิ่มแฟ้มที่ระบุไปยังแฟ้มที่พบ แล้วออกเมื่อเสร็จสิ้นแล้ว

source: Add the specified files to 'filename'. Create archive if it does not exist. Quit when finished.
th: เพิ่มแฟ้มต่าง ๆ ที่ระบุไปยัง 'ชื่อแฟ้ม' โดยสร้างแฟ้มจัดเก็บให้หากมันยังไม่มีอยู่ และออกเมื่อเสร็จสิ้นแล้ว

source: Change the current dir to the first entry and add all other entries relative to this one.
th: เปลี่ยนไดเรกทอรีปัจจุบันไปยังรายการแรกแล้วเพิ่มรายการอื่นทั้งหมดที่เหลือ ให้สัมพันธ์กับตัวดังกล่าว

source: Automatically choose a filename, with the selected suffix (for example rar, tar.gz, zip or any other supported types)
th: เลือกชื่อแฟ้มให้โดยอัตโนมัติ และใช้ส่วนต่อท้ายตามที่เลือกไว้ (ตัวอย่างเช่น rar, tar.gz, zip หรือชนิดแฟ้มใด ๆ ที่รองรับ)

source: Use the batch interface instead of the usual dialog. This option is implied if more than one url is specified.
th: ใช้ส่วนติดต่อแบบกลุ่มแทนกล่องโต้ตอบปกติ ตัวเลือกนี้จะมีผลปรับใช้ หากมีการระบุค่าที่อยู่ url มาให้มากกว่าหนึ่งที่อยู่

source: The destination argument will be set to the path of the first file supplied.
th: อาร์กิวเมนต์ของปลายทางจะถูกตั้งค่าเป็นพาธของแฟ้มตัวแรกที่จัดหามาให้

source: Archive contents will be read, and if detected to not be a single folder or a single file archive, a subfolder with the name of the archive will be created.
th: เนื้อหาของอาร์ไคฟ์จะถูกอ่าน และหากพบว่าไม่มีเพียงแค่โฟลเดอร์เดียวหรือไฟล์อาร์ไคฟ์เดียว โฟลเดอร์ย่อยจะถูกสร้างขึ้นด้วยชื่อของอาร์ไคฟ์

source: List supported MIME types.
th: รายการประเภท MIME ที่รองรับ

source: Unable to find Ark's KPart component, please check your installation.
th: ไม่สามารถค้นพบคอมโพเนนต์ KPart ของ Ark โปรดตรวจสอบการติดตั้งของคุณ

source: Sidebar
th: แถบด้านข้าง

source: Welcome Page
th: หน้ายินดีต้อนรับ

source: Show the welcome page
th: แสดงหน้ายินดีต้อนรับ

# @info:whatsthis
source: This switches between having a <emphasis>Menubar</emphasis> and having a <interface>Hamburger Menu</interface> button. Both contain mostly the same commands and configuration options.
th: ตัวเลือกนี้สลับระหว่างการมี<emphasis>แถบเมนู</emphasis> และการมีปุ่ม<interface>เมนูสามขีด</interface> โดยทั้งคู่มีคำสั่งและตัวเลือกในการตั้งค่าเหมือนกัน

source: Lock Sidebar
th: ล็อกแถบด้านข้าง

# to open an archive
source: Open Archive
th: เปิดอาร์ไคฟ์

source: Create New Archive
th: สร้างอาร์ไคฟ์ใหม่

source: Welcome to %1
th: ยินดีต้อนรับสู่ %1

source: No recent files
th: ไม่มีไฟล์ล่าสุด

source: Copy &Location
th: คัดลอก&ตำแหน่งไฟล์

source: &Open Containing Folder
th: &เปิดโฟลเดอร์ที่บรรจุ

source: &Remove
th: &ลบ

source: Welcome
th: ยินดีต้อนรับ

source: Open Archive…
th: เปิดอาร์ไคฟ์...

source: New Archive
th: อาร์ไคฟ์ใหม่

source: Clear Recent Files
th: ล้างรายการไฟล์ล่าสุด

source: Recent Files
th: ไฟล์ที่ใช้ล่าสุด

source: Help
th: ช่วยเหลือ

source: Visit homepage
th: เยี่ยมชมหน้าแรก

source: Read handbook
th: อ่านคู่มือ

source: Show on startup
th: แสดงเมื่อเปิดโปรแกรม

source: Close Welcome Page
th: ปิดหน้าต้อนรับ

source: Advanced Options
th: ตัวเลือกขั้นสูง

# @action:button
source: Add
th: เพิ่ม

source: Files/Folders to Compress
th: แฟ้ม/โฟลเดอร์ต่าง ๆ ที่จะทำการบีบอัด

source: Compress to Archive
th: บีบข้อมูลไปยังแฟ้มจัดเก็บ

source: No input files were given.
th: ยังไม่ได้ให้แฟ้มข้อมูลเข้ามา

source: You need to either supply a filename for the archive or a suffix (such as rar, tar.gz) with the <command>--autofilename</command> argument.
th: คุณต้องกำหนดชื่อแฟ้มของแฟ้มจัดเก็บหรือส่วนขยายต่อท้ายแฟ้ม (เช่น rar, tar.tz) ร่วมกับอาร์กิวเมนต์ <command>--autofilename</command> ด้วย

# @info
source: The archive <filename>%1</filename> already exists. Do you wish to overwrite it?
th: มีอาร์ไคฟ์ <filename>%1</filename> อยู่ก่อนแล้ว คุณต้องการที่จะเขียนทับหรือไม่

# @title:window
source: File Exists
th: มีแฟ้มอยู่ก่อนแล้ว

source: Whether to show a warning when creating zip archives with AES encryption.
th: เลือกว่าจะแสดงคำเตือนเมื่อสร้างไฟล์ zip ที่มีการเข้ารหัส AES หรือไม่

source: Default action when opening archive entries.
th: การกระทำเริ่มต้นเมื่อเปิดรายการไฟล์เก็บถาวร

source: Close Ark after extraction.
th: ปิด Ark หลังจากทำการแตกไฟล์แล้ว

source: Preserve paths when extracting.
th: คงค่าพาธไว้เมื่อทำการแตกไฟล์

source: Extract to a subfolder if the archive has more than one top-level entry.
th: แตกไฟล์ไปยังโฟลเดอร์ย่อยหากไฟล์อาร์ไคฟ์มีรายการไฟล์บนสุดมากกว่าหนึ่งรายการ

source: How the main window is divided.
th: หน้าต่างหลักถูกแบ่งอย่างไร

source: Whether to show the information panel.
th: แสดงแผงรายละเอียดหรือไม่

source: Whether to limit the preview according to file size.
th: จำกัดการพรีวิวขึ้นอยู่กับขนาดไฟล์หรือไม่

source: Preview file size limit in megabytes.
th: การจำกัดขนาดไฟล์ในการพรีวิวเป็นเมกะไบต์

# @info
source: Failed to locate program <filename>%1</filename> on disk.
th: ล้มเหลวในการค้นหาโปรแกรม <filename>%1</filename> บนดิสก์

source: Extraction failed. Make sure that enough space is available.
th: การแตกไฟล์ล้มเหลว โปรดตรวจสอบว่าคุณมีพื้นที่เพียงพอ

source: Extraction failed. Make sure you provided the correct password and that enough space is available.
th: การแตกไฟล์ล้มเหลว โปรดตรวจสอบให้แน่ใจว่าคุณใส่รหัสผ่านที่ถูกต้องและมีพื้นที่มากพอ

# @info
source: Could not move the extracted file to the destination directory.
th: ไม่สามารถย้ายไฟล์ที่ถูกแตกออกแล้วไปยังโฟลเดอร์ที่หมายได้

# @info
source: Extraction failed because the disk is full.
th: การแตกไฟล์ล้มเหลวเนื่องจากดิสก์เต็ม

# @info
source: Extraction failed: Incorrect password
th: การแตกไฟล์ล้มเหลว: รหัสผ่านไม่ถูกต้อง

source: Incorrect password.
th: รหัสผ่านไม่ถูกต้อง

source: Ark does not currently support testing this archive.
th: Ark ไม่รองรับการทดสอบอาร์ไคฟ์นี้

source: Protection of the list of files is not possible with the %1 format.
th: การปกป้องรายการไฟล์นั้นเป็นไปไม่ได้ด้วยฟอร์แมต %1

source: Protection of the archive with password is not possible with the %1 format.
th: การปกป้องอาร์ไคฟ์นี้ด้วยรหัสผ่านนั้นเป็นไปไม่ได้ด้วยฟอร์แมต %1

source: It is not possible to set compression level for the %1 format.
th: ไม่สามารถตั้งระดับการบีบอัดสำหรับฟอร์แมต %1 ได้

source: It is not possible to set compression method for the %1 format.
th: ไม่สามารถตั้งวิธีการบีบอัดสำหรับฟอร์แมต %1 ได้

source: The %1 format does not support multi-volume archives.
th: ฟอร์แมต %1 นั้นไม่รองรับอาร์ไคฟ์หลายวอลูม

source: Compression
th: การบีบอัด

source: Level:
th: ระดับ:

source: Min
th: น้อย

source: Method:
th: วิธีการ:

source: Max
th: มาก

source: Password Protection
th: การป้องกันด้วยรหัสผ่าน

source: Encryption method:
th: วิธีการเข้ารหัส:

source: Ask for password before showing the list of files in the archive
th: ถามรหัสผ่านก่อนแสดงรายการไฟล์ในอาร์ไคฟ์

source: This encryption method may not be supported by older archiving software.
th: วิธีเข้ารหัสนี้อาจไม่รองรับโดยซอฟต์แวร์อาร์ไคฟ์รุ่นเก่า

source: Multi-volume Archive
th: การอาร์ไคฟ์หลายวอลุ่ม

source: Create multi-volume archive
th: สร้างอาร์ไคฟ์หลายวอลุ่ม

source: Volume size:
th: ขนาดวอลุ่ม

source: megabytes
th: เมกะไบต์

# the argument is a file extension (the period is not a typo)
source: Automatically add .%1
th: เพิ่ม .%1 โดยอัตโนมัติ

source: The chosen password does not match the given verification password.
th: รหัสผ่านที่เลือกนั้นไม่ตรงกับรหัสผ่านยืนยันที่ใส่

source: Folder:
th: โฟลเดอร์:

source: Filename:
th: ชื่อไฟล์:

source: Type archive name…
th: พิมพ์ชื่ออาร์ไคฟ์...

source: Type:
th: ประเภท:

source: Extension:
th: ส่วนขยาย:

# @title:window
source: Extract
th: คลายแฟ้ม

source: Extract
th: แตกไฟล์

source: The subfolder name may not contain the character '/'.
th: ชื่อของโฟลเดอร์ย่อยจะต้องไม่มีตัวอักษร '/' อยู่ด้วย

# @info
source: The folder <filename>%1</filename> already exists. Are you sure you want to extract here?
th: มีโฟลเดอร์ <filename>%1</filename> อยู่แล้ว คุณแน่ใจหรือไม่ว่าจะทำการแตกไฟล์ไว้ที่นี่

source: Folder exists
th: มีโฟลเดอร์อยู่ก่อนแล้ว

source: Extract here
th: คลายแฟ้มไว้ที่นี่

source: Retry
th: ลองอีกครั้ง

# @info
source: The folder <filename>%1</filename> could not be created.
th: ไม่สามารถสร้างโฟลเดอร์ <filename>%1</filename> ได้

# @info
source: <filename>%1</filename> already exists, but is not a folder.
th: มี <filename>%1</filename> อยู่ก่อนแล้ว แต่มันไม่ใช่โฟลเดอร์

source: Please check your permissions to create it.
th: โปรดตรวจสอบสิทธ์ที่อนุญาตของคุณว่ามีสิทธิ์สร้างมันหรือไม่

source: Extract multiple archives
th: คลายแฟ้มจัดเก็บหลายแฟ้ม

source: Extraction Dialog
th: กล่องการคลายแฟ้ม

source: Extract All Files
th: คลายแฟ้มทั้งหมด

source: E&xtraction into subfolder:
th: &แตกไฟล์ไปยังโฟลเดอร์ย่อย:

source: Options
th: ตัวเลือกต่าง ๆ

source: Open &destination folder after extraction
th: เปิดโฟลเดอร์&ปลายทางหลังจากทำการคลายแฟ้มแล้ว

source: Close &Ark after extraction
th: ปิดโปรแกรม&อาร์กหลังจากทำการคลายแฟ้มแล้ว

source: &Preserve paths when extracting
th: &คงค่าพาธไว้เมื่อทำการคลายแฟ้ม

source: &Automatically create subfolders
th: ทำการสร้างโฟลเดอร์ย่อยให้โดย&อัตโนมัติ

# @title:group
source: Extract
th: คลายแฟ้ม

source: Sele&cted files only
th: ไฟล์ที่เ&ลือกไว้เท่านั้น

source: All &files
th: ไ&ฟล์ทั้งหมด

source: Open destination folder after extraction
th: เปิดโฟลเดอร์ปลายทางหลังจากการแตกไฟล์

source: Close Ark after extraction
th: ปิด Ark หลังจากการแตกไฟล์

source: Preserve paths when extracting
th: คงค่าพาธไว้เมื่อทำการแตกไฟล์

source: Whether to check by default the extraction into subfolder checkbox in the Extraction Dialog, when the archive has more than one top-level entry.
th: เมื่ออาร์ไคฟ์มีรายการไฟล์ระดับบนสุดมากกว่าหนึ่ง เลือกว่าจะแตกไฟล์ไปในโฟลเดอร์ย่อยเป็นค่าเริ่มต้นหรือไม่

source: Extract to a subfolder if the archive has more than one top-level entry
th: แตกไฟล์ไปยังโฟลเดอร์ย่อยหากไฟล์อาร์ไคฟ์มีรายการไฟล์บนสุดมากกว่าหนึ่งรายการ

source: When clicking a file in an archive or pressing the Return key:
th: เมื่อคลิกไฟล์ในอาร์ไคฟ์หรือกดปุ่ม Return:

source: Pre&view the file with internal previewer
th: พรี&วิวไฟล์ด้วยตัวพรีวิวภายใน

source: Open the fi&le with associated application
th: เปิดไฟ&ล์ด้วยแอพลิเคชันที่เกี่ยวข้อง

source: Show a warning when creating zip archives with AES encryption
th: แสดงคำเตือนเมื่อสร้างไฟล์ zip ที่มีการเข้ารหัส AES

source: No suitable plugin found. Ark does not seem to support this file type.
th: ไม่พบปลั๊กอินที่เหมาะสม Ark เหมือนจะไม่รองรับไฟล์ประเภทนี้

source: Failed to load a suitable plugin. Make sure any executables needed to handle the archive type are installed.
th: ไม่พบปลั๊กอินที่เหมาะสม โปรดตรวจสอบว่าไฟล์ปฏิบัติการที่จำเป็นสำหรับไฟล์อาร์ไคฟ์ประเภทนี้นั้นถูกติดตั้งแล้ว

source: Could not load the archive because it contains ill-formed entries and might be a malicious archive.
th: ไม่สามารถโหลดอาร์ไคฟ์ได้เนื่องจากมันมีรายการไฟล์ที่ไม่พึงประสงค์และอาจเป็นอาร์ไคฟ์ที่อันตราย

source: Loading archive
th: กำลังโหลดอาร์ไคฟ์...

source: Archive
th: อาร์ไคฟ์

source: No space available on device <filename>%1</filename>
th: ไม่เหลือพื้นที่บนอุปกรณ์ <filename>%1</filename>

source: Extracting all files
th: คลายแฟ้มทั้งหมด

source: Extracting one file
th: คลาย %1 แฟ้ม

# extraction folder
source: Destination
th: โฟลเดอร์ปลายทาง

source: Could not write to destination <filename>%1</filename>.<nl/>Check whether you have sufficient permissions.
th: ไม่สามารถเขียนไปยังปลายทาง <filename>%1</filename> ได้<nl/>โปรดตรวจสอบว่าคุณมีการอนุญาตที่เพียงพอ

source: Compressing a file
th: กำลังบีบอัด %1 ไฟล์

source: Moving a file
th: กำลังย้าย %1 ไฟล์

source: Copying a file
th: กำลังคัดลอก %1 ไฟล์

source: Deleting a file from the archive
th: ทำการลบแฟ้ม %1 แฟ้มออกจากแฟ้มจัดเก็บ

source: Adding comment
th: กำลังเพิ่มหมายเหตุ

source: Testing archive
th: กำลังทดสอบอาร์ไคฟ์

source: The plugin cannot be used because one or more required executables are missing. Check your installation.
th: ปลั๊กอินนี้ไม่สามารถใช้งานได้เนื่องจากไฟล์ปฏิบัติการหายไป โปรดตรวจสอบการติดตั้งของคุณ

source: Name
th: ชื่อ

source: Description
th: คำอธิบาย

source: Disable preview for files larger than:
th: ปิดพรีวิวสำหรับไฟล์ที่ใหญ่กว่า:

# @title:window
source: Properties for %1
th: คุณสมบัติสำหรับ %1

source: yes
th: ใช่

source: no
th: ไม่

source: yes (%1 volumes)
th: ใช่ (%1 วอลุ่ม)

source: %1 file
th: %1 ไฟล์

source: , %1 folder
th: %1 โฟลเดอร์

source: only file contents (%1)
th: เนื้อหาไฟล์เท่านั้น (%1)

source: yes (%1)
th: ใช่ (%1)

source: Calculating…
th: กำลังคำนวณ...

source: Archive name:
th: ชื่ออาร์ไคฟ์:

source: Archive type:
th: ประเภทอาร์ไคฟ์:

source: Mime-type:
th: ประเภท MIME:

source: Opened read-only:
th: เปิดแบบอ่านเท่านั้น:

source: Password-protected:
th: ป้องกันด้วยรหัสผ่าน:

source: Has comment:
th: มีหมายเหตุ:

source: Number of entries:
th: จำนวนรายการ:

source: Unpacked size:
th: ขนาดเมื่อแตกไฟล์:

source: Packed size:
th: ขนาดเมื่อบีบอัด:

source: Compression ratio:
th: อัตราส่วนการบีบอัด:

source: Last modified:
th: แก้ไขล่าสุด:

source: MD5 hash:
th: แฮช MD5:

source: SHA-1 hash:
th: แฮช SHA-1:

source: SHA-256 hash:
th: แฮช SHA-256:

source: Multi-volume:
th: หลายวอลุ่ม:

source: Compression method(s):
th: วิธีการบีบอัด:

# @title:window
source: File Already Exists
th: มีไฟล์อยู่ก่อนแล้ว

# @info
source: The archive <filename>%1</filename> is password protected. Please enter the password.
th: อาร์ไคฟ์ <filename>%1</filename> มีการป้องกันด้วยรหัสผ่าน โปรดใส่รหัสผ่าน

source: Incorrect password, please try again.
th: รหัสผ่านไม่ถูกต้อง โปรดลองใหม่อีกครั้ง

# @info
source: The archive you're trying to open is corrupt.<nl/>Some files may be missing or damaged.
th: อาร์ไคฟ์ที่คุณพยายามเปิดมีความเสียหาย<nl/>ไฟล์บางไฟล์อาจหายไปหรือเนื้อหาไม่ถูกต้อง

# @title:window
source: Corrupt archive
th: อาร์ไคฟ์เสียหาย

# @action:button
source: Open as Read-Only
th: เปิดแบบอ่านเท่านั้น

# @action:button
source: Don't Open
th: อย่าเปิด

source: Don't ask again.
th: ไม่ต้องถามอีก

source: Error during extraction
th: เกิดข้อผิดพลาดระหว่างการแตกไฟล์

source: Extraction of the entry:<nl/> <filename>%1</filename><nl/>failed with the error message:<nl/> %2<nl/><nl/>Do you want to continue extraction?<nl/>
th: การแตกไฟล์ของรายการ:<nl/> <filename>%1</filename><nl/>ล้มเหลวด้วยข้อความผิดพลาด:<nl/> %2<nl/><nl/>คุณต้องการแตกไฟล์ต่อหรือไม่<nl/>

# Name of a file inside an archive
source: Name
th: ชื่อ

# Uncompressed size of a file inside an archive
source: Original Size
th: ขนาดต้นฉบับ

# Compressed size of a file inside an archive
source: Compressed Size
th: ขนาดเมื่อบีบอัด

# Compression rate of file
source: Rate
th: อัตราการบีบอัด

# File's owner username
source: Owner
th: เจ้าของ

# File's group
source: Group
th: กลุ่ม

# File permissions
source: Mode
th: โหมด

# Compression method
source: Method
th: วิธีการ

# File version
source: Version
th: รุ่น

# Timestamp
source: Date
th: วันที่

source: Adding files is not supported for this archive.
th: การเพิ่มไฟล์ไม่ถูกรองรับโดยอาร์ไคฟ์นี้

source: You can only add local files to an archive.
th: คุณสามารถเพิ่มไฟล์ภายในเครื่องในอาร์ไคฟ์ได้เท่านั้น

source: &Archive
th: &อาร์ไคฟ์

source: &File
th: แ&ฟ้ม

source: &Settings
th: &ตั้งค่า

source: Main Toolbar
th: แถบเครื่องมือหลัก

source: &Help
th: &ช่วยเหลือ

source: Closing preview
th: ทำการปิดการแสดงตัวอย่าง

source: Please wait while the preview is being closed…
th: โปรดรอสักครู่ในระหว่างการปิดพรีวิว...

source: The internal viewer cannot preview this file.
th: ตัวแสดงตัวอย่างภายใน ไม่สามารถแสดงตัวอย่างแฟ้มนี้ได้

source: The internal viewer cannot preview this type of file<nl/>(%1).<nl/><nl/>Do you want to try to view it as plain text?
th: ตัวพรีวิวภายในไม่สามารถพรีวิวไฟล์ประเภทนี้ได้<nl/>(%1)<nl/><nl/>คุณต้องการดูไฟล์นี้เป็นข้อความธรรมดาหรือไม่

# @title:window
source: Cannot Preview File
th: ไม่สามารถพรีวิวไฟล์ได้

# @action:button
source: Preview as Text
th: พรีวิวเป็นข้อความ

source: The internal viewer cannot preview this unknown type of file.<nl/><nl/>Do you want to try to view it as plain text?
th: ตัวพรีวิวภายในไม่สามารถพรีวิวประเภทไฟล์ที่ไม่รู้จักนี้ได้<nl/><nl/>คุณต้องการดูไฟล์นี้เป็นข้อความธรรมดาหรือไม่

# @action
source: About Viewer Component
th: เกี่ยวกับส่วนประกอบตัวพรีวิว

source: No archive loaded
th: ยังไม่มีการโหลดแฟ้มจัดเก็บใด ๆ

source: Symbolic Link
th: แฟ้มเชื่อมโยงแบบสัญลักษณ์

source: Unknown size
th: ไม่ทราบขนาด

source: One file selected
th: เลือกไว้ %1 แฟ้ม

source: Information Panel
th: แถบข้อมูลรายละเอียด

source: Unknown file type
th: ประเภทแฟ้มที่ไม่รู้จัก

source: Owner:
th: เจ้าของ:

source: Group:
th: กลุ่ม:

source: Target:
th: เป้าหมาย:

source: Job Tracker
th: ตัวติดตามงาน

source: <b>Job Description</b>
th: <b>รายละเอียดงาน</b>

source: Some Information about the job
th: ข้อมูลรายละเอียดบางอย่างเกี่ยวกับงาน

source: Files with the following paths already exist. Remove them if you really want to overwrite.
th: ไฟล์พาธต่อไปนี้มีอยู่แล้ว โปรดลบมันหากคุณต้องการที่จะเขียนทับ

source: Files with the following paths already exist. Do you want to continue overwriting them?
th: ไฟล์พาธต่อไปนี้มีอยู่แล้ว คุณต้องการที่จะเขียนทับพวกมันหรือไม่

source: Comment
th: หมายเหตุ

source: Comment has been modified.
th: หมายเหตุถูกดัดแปลง

source: Save
th: บันทึก

source: Type to search…
th: พิมพ์เพื่อค้นหา...

# @info
source: Ark can extract archives to local destinations only.
th: Ark สามารถแตกไฟล์ไปยังสถานที่ภายในเครื่องเท่านั้น

# @action:inmenu
source: Show Information Panel
th: แสดงแผงรายละเอียด

# @action:inmenu
source: Save Copy As…
th: บันทึกสำเนาเป็น...

# open a file with external program
source: &Open in External Application
th: &เปิดในแอพลิเคชันภายนอก

# open a file with external program
source: Open &With…
th: เปิด&ด้วย...

# @info:tooltip
source: Click to open the selected file with an external program
th: คลิกเพื่อเปิดไฟล์ที่เลือกด้วยโปรแกรมภายนอก

# to preview a file inside an archive
source: Pre&view
th: แสดง&ตัวอย่าง

# @info:tooltip
source: Click to preview the selected file
th: คลิกเพื่อแสดงตัวอย่างของไฟล์ที่เลือก

# @action:inmenu
source: E&xtract All
th: แ&ตกไฟล์ทั้งหมด

source: Click to open an extraction dialog, where you can choose how to extract all the files in the archive
th: คลิกเพื่อเปิดไดอะล็อกแตกไฟล์ ซึ่งคุณจะสามารถเลือกได้ว่าจะแตกไฟล์ทั้งหมดในอาร์ไคฟ์อย่างไร

# @action:inmenu
source: &Extract
th: &แตกไฟล์

source: Click to open an extraction dialog, where you can choose to extract either all files or just the selected ones
th: คลิกเพื่อเปิดกล่องการคลายแฟ้ม ซึ่งคุณจะสามารถเลือกได้ว่า จะทำการคลายแฟ้มทั้งหมด หรือคลายเฉพาะแฟ้มที่เลือก

source: Add &Files…
th: เพิ่มไ&ฟล์...

# @info:tooltip
source: Click to add files to the archive
th: คลิกเพื่อเพิ่มไฟล์เข้าไปยังอาร์ไคฟ์

# @action
source: Remove from Archive
th: ลบจากอาร์ไคฟ์

# @action:inmenu
source: &Properties
th: &คุณสมบัติ

# @info:tooltip
source: Click to see properties for archive
th: คลิกเพื่อดูคุณสมบัติของอาร์ไคฟ์

# @info:tooltip
source: Click to add or edit comment
th: คลิกเพื่อเพิ่มหรือแก้ไขหมายเหตุ

# @action:inmenu
source: &Test Integrity
th: &ทดสอบความถูกต้อง

# @info:tooltip
source: Click to test the archive for integrity
th: คลิกเพื่อทดสอบความถูกต้องของอาร์ไคฟ์

# @info:tooltip
source: Adding files to existing password-protected archives with no header-encryption is currently not supported.<nl/><nl/>Extract the files and create a new archive if you want to add files.
th: การเพิ่มไฟล์ไปยังอาร์ไคฟ์ที่ถูกปกป้องด้วยรหัสผ่านที่ไม่มีการเข้ารหัสส่วนหัวนั้นยังไม่ถูกรองรับ<nl/><nl/>แตกไฟล์ออกแล้วสร้างอาร์ไคฟ์ใหม่หากคุณต้องการที่จะเพิ่มไฟล์

# @info:tooltip
source: Testing password-protected archives with no header-encryption is currently not supported.
th: การทดสอบไฟล์อาร์ไคฟ์ที่ถูกปกป้องด้วยรหัสผ่านที่ไม่มีการเข้ารหัสส่วนหัวนั้นยังไม่ถูกรองรับ

# @action:inmenu mutually exclusive with Add &Comment
source: Edit &Comment
th: แก้ไข&หมายเหตุ

# @action:inmenu mutually exclusive with Edit &Comment
source: Add &Comment
th: เพิ่ม&หมายเหตุ

source: The archive passed the integrity test.
th: อาร์ไคฟ์ผ่านการทดสอบความถูกต้อง

source: Test Results
th: ผลการทดสอบ

source: The archive failed the integrity test.
th: ไฟล์อาร์ไคฟ์ไม่ผ่านการทดสอบความถูกต้อง

source: Extract To…
th: แตกไฟล์ไปที่...

source: Quick Extract To…
th: แตกไฟล์อย่างรวดเร็วไปยัง...

# @title:tab
source: General
th: ทั่วไป

# @title:tab
source: Extraction
th: การแตกไฟล์

# @title:tab
source: Plugins
th: ปลั๊กอิน

# @title:tab
source: Previews
th: พรีวิว

# @info
source: <filename>%1</filename> is a directory.
th: <filename>%1</filename> เป็นไดเรกทอรี
